Revit.Elements.Parameter.SpecType
Get the parameter's SpecType

Revit.Elements.Parameter.GroupType
Get the Parameter's Group Type

Revit.Elements.Parameter.Unit
Get the Parameter's Unit Type

Revit.Elements.Parameter.CreateSharedParameterForAllCategories(System.String,System.String,Revit.Elements.SpecType,Revit.Elements.GroupType,System.Boolean)
Create a new Shared Parameter in the current Revit document for all applicable categories
parameterName: Name
groupName: Group of the parameter for shared parameters
specType: The type of new parameter.
groupType: The type of the group to which the parameter belongs.
instance: True if it's an instance parameter, otherwise it's a type parameter

Revit.Elements.Parameter.CreateSharedParameter(System.String,System.String,Revit.Elements.SpecType,Revit.Elements.GroupType,System.Boolean,System.Collections.Generic.IEnumerable{Revit.Elements.Category})
Create a new Shared Parameter in the current Revit document
parameterName: Name
groupName: Group of the parameter for shared parameters
specType: The type of new parameter.
groupType: The type of the group to which the parameter belongs.
instance: True if it's an instance parameter, otherwise it's a type parameter
categoryList: A list of categories this parameter applies to. If no category is supplied, all possible categories are selected

Revit.Elements.Parameter.CreateProjectParameterForAllCategories(System.String,System.String,Revit.Elements.SpecType,Revit.Elements.GroupType,System.Boolean)
Create a new Project Parameter in this current Revit document for all applicable categories
parameterName: Name
groupName: Group of the parameter for shared parameters
specType: The type of new parameter.
groupType: The type of the group to which the parameter belongs.
instance: True if it's an instance parameter, otherwise it's a type parameter

Revit.Elements.Parameter.CreateProjectParameter(System.String,System.String,Revit.Elements.SpecType,Revit.Elements.GroupType,System.Boolean,System.Collections.Generic.IEnumerable{Revit.Elements.Category})
Create a new Project Parameter in this current Revit document
parameterName: Name
groupName: Group of the parameter for shared parameters
specType: The type of new parameter.
groupType: The type of the group to which the parameter belongs.
instance: True if it's an instance parameter, otherwise it's a type parameter
categoryList: A list of categories this parameter applies to. If no category is supplied, all possible categories are selected